# Constraints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Constraints Property
GroupTypeId Class See Also
---
Constraints.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Constraints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Constraints As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Constraints {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace